#+TITLE:  ORG-R-TEST
#+AUTHOR: Tobias Maier
#+EMAIL:  t.maier@kit.edu


** Alpha VS TIN
#+BEGIN_SRC R :session :results output
  #graphics :file plot.png
  t <- function (d, x,y, bla)
  {
      return (d[maskTL(d,256) & maskCAP(d,1) & maskBS(d,bla),c(x,y)]) #(maskTL(maskCAP(maskBS(d,bla),1), 256))
  }

  y='tfi'
  x='al'

  range_t = range(0, t(grows_bfs,x,y)[y], t(grows_rwalk,x,y)[y]) #, t(grows_rwalkcyc,x,y)[y])

  plot  (t(grows_bfs, x, y, 8 ) , col="black", ylim=c(0,16000))
  points(t(grows_bfs, x, y, 4 ) , col="blue")
  points(t(grows_bfs, x, y, 6 ) , col="green")
  points(t(grows_bfs, x, y, 12) , col="violet")
  points(t(grows_bfs, x, y, 16) , col="orange")
  #par(new=2)
  y='tin'
  plot  (t(grows_bfs, x, y, 8 ) , col="black", ylim=c(0,50000))
  points(t(grows_bfs, x, y, 4 ) , col="blue")
  points(t(grows_bfs, x, y, 6 ) , col="green")
  points(t(grows_bfs, x, y, 12) , col="violet")
  points(t(grows_bfs, x, y, 16) , col="orange")

  points(t(hopscotch ,x, y, 8 ) , col="red"  )

  lines  (c(-999, 999),c(0,0), col="black" )
  #points(t(grows_rwalkcyc), col="green")
#+END_SRC

#+RESULTS:
: Fehler in maskBS(d, bla) (von unknown!2822KMP#3) : Argument "bla" fehlt (ohne Standardwert)


